package ua.com.vtkachenko.ciklum.kyiv.algorythms.club47DelaunayTriangulation.task1;

/*
Триангуляция Деломе
Гаусс занимался измерением площади составляя територию из триугольников
Очень часто используется в геодезии
Используется в инженерии чтоб посчитать прочность, характеристики, смоделировать как будет работать. Например коробка передач автомобиля

Триангуляция может быть в N-мерном пространстве
Используется для прорисовки лица человека

Триангуляция может быть представлена: соседними точками; двойными ребрами; точками, треугольниками и ребром

Нам важно знать принадлежит точка треугольнику или нет: Если мы будем обходить треугольник против часовой стрелки
и если для каждого ребра будет точка находится слева от ребра - то эта точка будет принадлежать этому триугольнику.
Иначе эта точка не принадлежит этому треугольнику.

Алгоритмов для построения Триангуляции есть много.
 */
public class Solution {
}
