package ua.com.vtkachenko.ciklum.kyiv.algorythms.club40.task2;

/*
Для економії пам'яті в новому комп'ютері числа замінюються на
близькі за значенням числа-поліндроми, і як результат запам'ятовується лише
перша половина отриманого поліндрома. Вам потрібно написати програму
для описаного комп'ютера, яка швидко по заданому числу знаходить
найменший поліндром, який більший або рівний цьому числу.
Вхідні дані. в першому рядку файлу number.dat записане єдине
натуральне число, кількість цифр якого не перевищує 1000.
Вихідні дані. в перший рядок виведіть шуканий
поліндром.
Приклад вхідних і вихідних даних:
INPUT
1711
OUTPUT
1771
 */
public class Solution {

    public int findPalindrom(int a){

        return 0;

    }
}
