package ua.com.vtkachenko.ciklum.kyiv.algorythms.belkacontest.task2;
/*
Курс корабля

Дано координати хвоста корабля (Xe, Ye) і його носу (Xs, Ys). А також координати певного об'єкту в морі (Xo, Yo). Вам необхідно написати програму, що визначає орієнтацію о'бєкта відносно напряму руху корабля.

Вхідні дані: В першому рядку записане ціле число T (1 <= T <= 20), кількість тестів. В наступних T рядках координати Xe, Ye, Xs, Ys, Xo, Yo. Координата об'єкта ніколи не буде співпадати з координатими корабля.
-200 <= Xe, Ye, Xs, Ys, Xo, Yo <= 200

Вихідні дані: Для кожного тесту необхідно вивести літеру - орієнтація об'єкта відносно корабля.
F - об'єкт прямо по курсу, з точністю 0.000001 рад кута між напрямом руху і прямою (хвіст корабля, об'єкт).
B - об'єкт позаду корабля, кут PI (з точністю 0.000001 рад) між напрямом руху і прямою (хвіст корабля, об'єкт).
L - об'єкт ліворуч корабля.
R - об'єкт праворуч.
Приклад

Input
3
0 0 0 3 1 1
0 0 0 3 0 5
0 3 1 0 5 5

Output
R
F
L

 */
public class Solution {
    public static void main(String[] args) {

    }
}
