package ua.com.vtkachenko.ciklum.kyiv.algorythms.club42.task2;

/*
Двоє учаників Хмельницької заочної олімпіади з інформатики грають у гру. На столі лежить купка з N сірників(N<=100).
Учасники ходять по черзі. При своєму черговому ході гравець ділить кожну купку, в якій більше одного сірника, на дві менші.
Перемога дістається тому з гравців, хто після свого ходу залишає лише купки з 1 сірника. Хто з гравців може забезпечити собі перемогу?

Вхідні дані: в першому рядку знаходиться число
T - кількість тестів (T<=50). Далі в цьому ж рядку через пропуск йдуть T чисел – кількості сірників у початковій купці для кожного тесту.

Вихідні дані: в перший рядок потрібно записати через пропуск T чисел – відповіді до відповідних тестів: 0,
якщо перший гравець не зможе перемогти при правильній грі другого гравця; 1, якщо перший гравець може забезпечити собі перемогу.

Приклад вхідних і вихідних даних:

INPUT
2 3 4

EXPECTED OUTPUT
0 1



 */
public class Solution {
//    public static void main(String[] args) {

//        int t;
//        int cin;
//        cin>>t;
//        int num;
//        for (int i = 0; i < t; i++) {
//            cin>>num;
//            if (((num+1)&num)==0)
//        }


}
